UB_Copy/src/Documents/УБ_РасчетЭффективностиСотрудников/УБ_РасчетЭффективностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УБ_РасчетЭффективностиСотрудников</name>
  <registerRecords>AccumulationRegister.УБ_КоэффициентыРаспределенияБезокладнойСистемыПоказателейВакантныхПозиций</registerRecords>
  <registerRecords>AccumulationRegister.УБ_ДанныеПоказателейРасчетаЗарплаты</registerRecords>
  <registerRecords>AccumulationRegister.УБ_ДанныеНачисленийРасчетаЭффективностиСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.УБ_ДанныеИтоговыхНачисленийРасчетаЭффективностиСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.УБ_КоэффициентыРаспределенияБезокладнойСистемыПоказателей</registerRecords>
  <registerRecords>InformationRegister.УБ_СостоянияДокументовРасчетаЭффективностиСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>DefinedType.УБ_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияГрейда</name>
    <type>
      <types>CatalogRef.УБ_ВерсииГрейдов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланУтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактУтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяОценкаПоСтандартам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаПремии</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаПремии</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаПоказателей</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчетнойБазы</name>
    <type>
      <types>CatalogRef.УБ_ПоказателиЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКРаспределению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредельныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ПоказательЭффективности</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритическоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеЗначениеРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеЗначениеРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Эффективность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеЗначениеРасценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеЗначениеВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеЗначениеПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеКритическоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассчитанноеЗначениеФакта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаПоказателей</name>
      <type>
        <types>CatalogRef.УБ_ШкалыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКартинкиГраницЭффективности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассчитанноеЗначениеПлана</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИтоговыеНачисления</name>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Эффективность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыОценкиСотрудника</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.УБ_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаОценок</name>
      <type>
        <types>CatalogRef.УБ_ШкалыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>CatalogRef.УБ_ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыОценкиРуководителя</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.УБ_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаОценок</name>
      <type>
        <types>CatalogRef.УБ_ШкалыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>CatalogRef.УБ_ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеПремииПодразделения</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>DefinedType.УБ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредельныйКоэффициентРЭ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отсутствия</name>
    <attributes>
      <name>ПричинаОтсутствия</name>
      <type>
        <types>CatalogRef.УБ_ПричиныОтсутствия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UB_Copy/src/AccumulationRegisters/УБ_ДанныеПоказателейРасчетаЗарплаты/УБ_ДанныеПоказателейРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УБ_ДанныеПоказателейРасчетаЗарплаты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РаспределениеПремии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>DefinedType.УБ_ПоказателиРасчетаЗарплаты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

UB_Copy/src/Documents/УБ_РасчетЭффективностиСотрудников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Сотрудник") Тогда
			КадровыеДанные = УБ_КадровыйУчет.КадровыеДанныеСотрудников(ДанныеЗаполнения.Сотрудник, НачалоПериода);
			Если КадровыеДанные.Количество() Тогда
				ТекущиеКадровыеДанные = КадровыеДанные[0];
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТекущиеКадровыеДанные);
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Организация")
			И Не ЗначениеЗаполнено(Организация) Тогда
			Организация = ДанныеЗаполнения.Организация
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Подразделение")
			И Не ЗначениеЗаполнено(Подразделение) Тогда
			Подразделение = ДанныеЗаполнения.Подразделение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Подразделение) Тогда
			
			Если Не ЗначениеЗаполнено(Организация)
				Или Организация <> Подразделение.Владелец Тогда
				Организация = Подразделение.Владелец;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УБ_ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.УБ_РасчетЭффективностиСотрудников.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	УБ_ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыСведений.УБ_СостоянияДокументовРасчетаЭффективностиСотрудников.ОтразитьСостоянияДокументовРасчетаЭффективностиСотрудников(
		ДополнительныеСвойства, Движения, Отказ);
	РегистрыНакопления.УБ_ДанныеПоказателейРасчетаЗарплаты.ОтразитьДанныеПоказателейРасчетаЗарплаты(
		ДополнительныеСвойства, Движения, Отказ);
	РегистрыНакопления.УБ_ДанныеНачисленийРасчетаЭффективностиСотрудников.ОтразитьДанныеНачисленийРасчетаЭффективностиСотрудников(
		ДополнительныеСвойства, Движения, Отказ);
	РегистрыНакопления.УБ_ДанныеИтоговыхНачисленийРасчетаЭффективностиСотрудников.ОтразитьДанныеИтоговыхНачисленийРасчетаЭффективностиСотрудников(
		ДополнительныеСвойства, Движения, Отказ);
	РегистрыНакопления.УБ_КоэффициентыРаспределенияБезокладнойСистемыПоказателей.ОтразитьКоэффициентыРаспределенияБезокладнойСистемыПоказателей(
		ДополнительныеСвойства, Движения, Отказ);
	РегистрыНакопления.УБ_КоэффициентыРаспределенияБезокладнойСистемыПоказателейВакантныхПозиций.ОтразитьКоэффициентыРаспределенияБезокладнойСистемыПоказателей(
		ДополнительныеСвойства, Движения, Отказ);	
		
	УБ_ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	УБ_ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СтандартыОценкиСотрудника.Количество() И СтандартыОценкиСотрудника.Итог("Вес") <> 100 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Общий вес стандартов сотрудника должен равняться ""100""'"),
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СтандартыОценкиСотрудника", 1, "Вес"),
			,
			Отказ);
	КонецЕсли;
	
	Если СтандартыОценкиРуководителя.Количество() И СтандартыОценкиРуководителя.Итог("Вес") <> 100 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Общий вес стандартов руководителя должен равняться ""100""'"),
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СтандартыОценкиРуководителя", 1, "Вес"),
			,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	УБ_ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	УБ_ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	УБ_ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	УБ_ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	//++Корректировка, возможно, не требуется. Индикаторы заполняются динамически при создании формы
	КорректировкаИндикаторов();
	//--
КонецПроцедуры

Процедура КорректировкаИндикаторов()
	
	Для Каждого СтрокаНачислений Из Начисления Цикл
		
		Если СтрокаНачислений.ПроцентВыполнения <= СтрокаНачислений.ПоказательЭффективности.НегативноеОтклонениеНормыДо И НЕ СтрокаНачислений.План = 0 Тогда
			СтрокаНачислений.ИндексКартинкиГраницЭффективности = 4;
		ИначеЕсли СтрокаНачислений.ПроцентВыполнения >= СтрокаНачислений.ПоказательЭффективности.ПозитивноеОтклонениеНормыОт И НЕ СтрокаНачислений.План = 0 Тогда
			СтрокаНачислений.ИндексКартинкиГраницЭффективности = 9;
		ИначеЕсли СтрокаНачислений.ПроцентВыполнения >= СтрокаНачислений.ПоказательЭффективности.ПограничноеОтклонениеНормыОт 
			И СтрокаНачислений.ПроцентВыполнения <= СтрокаНачислений.ПоказательЭффективности.ПограничноеОтклонениеНормыДо И Не СтрокаНачислений.План = 0 Тогда
			СтрокаНачислений.ИндексКартинкиГраницЭффективности = 8;
		Иначе СтрокаНачислений.ИндексКартинкиГраницЭффективности = 0; 
		КонецЕсли;				
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Организация = Справочники.Организации.ПустаяСсылка();
	Подразделение = УБ_ОбщегоНазначения.ЗначениеРеквизитаПоУмолчанию("Подразделение");
	Сотрудник = УБ_ОбщегоНазначения.ЗначениеРеквизитаПоУмолчанию("Сотрудник");
	Должность = УБ_ОбщегоНазначения.ЗначениеРеквизитаПоУмолчанию("Должность");
	МодельПланированияЭффективности = Справочники.УБ_МоделиПланированияЭффективности.ПустаяСсылка();
	Грейд = Справочники.УБ_Грейды.ПустаяСсылка();
	ПланУтвержден = Ложь;
	ФактУтвержден = Ложь;
	ИтоговаяОценкаПоСтандартам = 0;
	ВариантРасчетаПремии = Перечисления.УБ_ВариантыРасчетаПремии.ПустаяСсылка();
	ШкалаПоказателей = Справочники.УБ_ШкалыПоказателей.ПустаяСсылка();
	Комментарий = "";
	
	Начисления.Очистить();
	ИтоговыеНачисления.Очистить();
	СтандартыОценкиРуководителя.Очистить();
	СтандартыОценкиСотрудника.Очистить();
	РаспределениеПремииПодразделения.Очистить();
	Отсутствия.Очистить();
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный = Пользователи.ТекущийПользователь();
	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода = КонецМесяца(НачалоПериода);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
